InformationRegisters/ВыбранныеВопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВыбранныеВопросы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вопросы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыТест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Главы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыбранныеВопросы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьГлаву(Вопрос)
	Возврат Вопрос.Глава;
КонецФункции	
&НаСервере
Функция ПолучитьЗначениеСчетчика()
	 Возврат Константы.Счетчик.Получить();
КонецФункции	
&НаКлиенте
Процедура ВопросыПриИзменении(Элемент)
	Запись.Счетчик = ПолучитьЗначениеСчетчика(); 
	Запись.Глава = ПолучитьГлаву(Запись.Вопросы);
КонецПроцедуры
